[
  {
    "frameworkId": 8,
    "name": "Introduction to SCAMPER",
    "description": "Learn the basics of the SCAMPER technique and how it can spark innovation.",
    "content": "<h2>What is SCAMPER?</h2><p>SCAMPER is a creative thinking technique used to generate innovative ideas for product, service, or process improvement. The acronym stands for: Substitute, Combine, Adapt, Modify, Put to another use, Eliminate, and Reverse.</p><p>Developed by Bob Eberle in the early 1970s, SCAMPER provides a structured approach to creative thinking by prompting specific types of modifications to existing ideas or products.</p><h3>The Seven SCAMPER Techniques</h3><ul><li><strong>Substitute:</strong> Replace parts, materials, people, or processes with something else</li><li><strong>Combine:</strong> Merge elements, ideas, or purposes</li><li><strong>Adapt:</strong> Adjust or repurpose for a new use or situation</li><li><strong>Modify/Magnify/Minify:</strong> Change attributes like size, shape, or frequency</li><li><strong>Put to another use:</strong> Find new ways to use existing products or services</li><li><strong>Eliminate:</strong> Remove elements, simplify, or reduce to core functionality</li><li><strong>Reverse/Rearrange:</strong> Change order, sequence, or layout; turn inside out or upside down</li></ul>",
    "examples": "Example 1: SCAMPER at 3M\n3M's Post-it Notes were born when a scientist adapted (A) a weak adhesive considered a failure, putting it to another use (P) as a removable bookmark that wouldn't damage pages.\n\nExample 2: Dyson Vacuum\nJames Dyson substituted (S) the traditional vacuum bag with cyclone technology and eliminated (E) the loss of suction that occurred as bags filled with dust, creating a revolutionary product.",
    "keyTakeaways": "• SCAMPER provides specific mental prompts to stimulate creative thinking\n• The technique works well for improving existing products, services, or processes\n• It can be applied individually or in group brainstorming sessions\n• SCAMPER is particularly effective when used systematically, working through each letter\n• Not every prompt will yield useful ideas, but the process stimulates innovative thinking",
    "completed": false,
    "order": 1
  },
  {
    "frameworkId": 8,
    "name": "Substitute",
    "description": "Explore the first SCAMPER technique: replacing components, materials, or people.",
    "content": "<h2>The Substitute Technique</h2><p>Substitution involves replacing one or more parts of a product, service, or process with something else. This could mean changing materials, ingredients, people, places, emotions, or even processes.</p><h3>Key Substitution Questions</h3><ul><li>What materials or resources can be replaced?</li><li>What parts could be swapped for others?</li><li>Who else could be involved instead?</li><li>What other process could be used?</li><li>What would happen if you changed the tone or emotion?</li><li>What different place, time, or context could be used?</li></ul><h3>Benefits of Substitution</h3><p>Substitution can lead to innovations that improve sustainability, reduce costs, enhance performance, or open new markets. Often the act of considering substitutions can unlock entirely new ways of thinking about a problem.</p>",
    "examples": "Example 1: Beyond Meat\nBeyond Meat substituted animal protein with plant-based ingredients to create meat alternatives that look, cook, and taste like conventional meat.\n\nExample 2: Digital Banking\nOnline banking substituted physical branch visits with digital interfaces, transforming the customer experience while reducing overhead costs.\n\nExample 3: Ride-sharing Apps\nUber and Lyft substituted traditional taxi dispatchers with algorithmic matching via smartphone apps, creating a more efficient system and better user experience.",
    "keyTakeaways": "• Substitution can lead to cost reduction, sustainability improvements, or enhanced features\n• Consider both obvious and non-obvious elements that could be substituted\n• Think about substituting not just physical components but also processes and experiences\n• The most innovative substitutions often come from completely different industries or contexts\n• Combining multiple substitutions can lead to transformative innovations",
    "completed": false,
    "order": 2
  },
  {
    "frameworkId": 8,
    "name": "Combine",
    "description": "Master the Combine technique to merge elements, ideas, or purposes into new innovations.",
    "content": "<h2>The Combine Technique</h2><p>Combination involves merging two or more elements, products, services, or concepts to create something new or improved. This technique can create unexpected synergies and unique value propositions.</p><h3>Key Combination Questions</h3><ul><li>What ideas, features, or purposes could be combined?</li><li>What would happen if you merged this product/service with another?</li><li>How could you combine objectives or targets?</li><li>What different resources or capabilities could you blend?</li><li>Could different talents or skills be combined?</li><li>What materials could be blended to create something better?</li></ul><h3>Approaches to Combination</h3><p>Combinations can be complementary (adding features that enhance core value), cross-disciplinary (bringing together concepts from different fields), or unexpected (merging seemingly unrelated elements to create something novel).</p>",
    "examples": "Example 1: Swiss Army Knife\nThe Swiss Army Knife combined multiple tools (knife, scissors, screwdriver, etc.) into a single, portable device, creating a highly versatile product.\n\nExample 2: Smartphone\nThe modern smartphone combined a phone, camera, computer, music player, GPS, and numerous other devices into one essential product.\n\nExample 3: Shopify\nShopify combined e-commerce functionality, payment processing, inventory management, and website hosting into a unified platform for online retailers.",
    "keyTakeaways": "• Combination can create products or services that offer more value than the sum of their parts\n• Look for complementary functions or features that could be merged\n• Consider combinations across different industries or domains\n• Successful combinations often reduce complexity or consolidate multiple steps\n• Consider both physical combinations and conceptual/service combinations",
    "completed": false,
    "order": 3
  },
  {
    "frameworkId": 8,
    "name": "Adapt",
    "description": "Learn to apply the Adapt technique to adjust or repurpose existing ideas for new circumstances.",
    "content": "<h2>The Adapt Technique</h2><p>Adaptation involves taking an existing idea, product, service, or process and altering it to serve a different purpose or work in a new context. This technique encourages you to look at successful concepts and consider how they could be modified to address your specific challenges.</p><h3>Key Adaptation Questions</h3><ul><li>What else is like this that you could draw inspiration from?</li><li>What ideas from other fields could you incorporate?</li><li>What historical approaches could be updated for today?</li><li>How have others solved similar problems?</li><li>What natural systems or processes could provide inspiration?</li><li>What lessons from unrelated industries apply here?</li></ul><h3>Types of Adaptation</h3><p>Adaptations can be context-based (moving an idea to a new setting), function-based (adjusting what something does), or scale-based (making something work for different sizes or scopes).</p>",
    "examples": "Example 1: Velcro\nGeorge de Mestral adapted the concept of burrs sticking to his dog's fur to create Velcro, a widely used fastening system.\n\nExample 2: Airbnb\nAirbnb adapted the bed and breakfast concept to a digital platform, creating a global marketplace for unused residential space.\n\nExample 3: Telemedicine\nTelemedicine adapted traditional medical consultations to virtual environments, increasing accessibility and efficiency.",
    "keyTakeaways": "• Look for successful solutions in unrelated fields that could be adapted to your problem\n• Nature is often an excellent source of adaptable designs and processes (biomimicry)\n• Historical approaches can sometimes be updated with modern technology to create innovations\n• Adaptation often requires understanding the underlying principles, not just copying surface features\n• The best adaptations typically require additional refinement to work in new contexts",
    "completed": false,
    "order": 4
  },
  {
    "frameworkId": 8,
    "name": "Modify/Magnify/Minify",
    "description": "Explore the Modify technique to change attributes, scale up, or scale down features.",
    "content": "<h2>The Modify Technique</h2><p>Modification encompasses changing attributes of a product, service, or process. This includes magnifying (increasing, strengthening, or exaggerating elements) and minifying (reducing, simplifying, or making elements smaller). By altering characteristics like size, shape, color, meaning, or frequency, you can discover valuable innovations.</p><h3>Key Modification Questions</h3><ul><li>What aspects could be magnified, exaggerated, or enlarged?</li><li>What features could be minimized, reduced, or compressed?</li><li>How could you change the shape, color, texture, or sound?</li><li>What could you make lighter, smaller, or more streamlined?</li><li>How could you increase frequency, strength, or height?</li><li>What details could be added or embellished?</li></ul><h3>Strategic Modification Approaches</h3><p>Consider both physical modifications (size, shape, materials) and conceptual modifications (user experience, emotional response, frequency of use, level of customization).</p>",
    "examples": "Example 1: Supersizing in Fast Food\nMcDonald's magnified portion sizes to create \"supersized\" meals, appealing to customers seeking value and larger servings.\n\nExample 2: MacBook Air\nApple minified the laptop, creating an ultra-thin design that prioritized portability without significantly compromising functionality.\n\nExample 3: Luxury Brands\nLuxury brands often modify standard products by using premium materials, enhancing craftsmanship, and adding distinctive design elements to justify higher price points.",
    "keyTakeaways": "• Modifications can create new value through exaggeration or reduction of key attributes\n• Consider what would happen if you took modifications to extremes (10x bigger or 10x smaller)\n• Look at attributes customers value most and explore magnifying those specifically\n• Sometimes reducing or eliminating features creates more value through simplicity\n• Digital products can be modified in ways physical products cannot (e.g., personalization at scale)",
    "completed": false,
    "order": 5
  },
  {
    "frameworkId": 8,
    "name": "Put to Another Use",
    "description": "Discover how to repurpose existing products, services, or ideas for entirely new uses.",
    "content": "<h2>The Put to Another Use Technique</h2><p>This technique involves finding alternative applications or scenarios for existing products, services, ideas, or processes. By repurposing what already exists, you can often discover untapped potential and create new value without developing something from scratch.</p><h3>Key 'Put to Another Use' Questions</h3><ul><li>What else could this be used for?</li><li>Are there new ways to use this as is?</li><li>Other uses if modified?</li><li>What other markets or customer segments could benefit from this?</li><li>How would a child/senior/different industry use this?</li><li>What other problems could this solve?</li></ul><h3>Approaches to Finding New Uses</h3><p>Consider different contexts (home vs. office vs. industrial), different user groups (children vs. professionals), different industries, or even byproducts and waste streams that might have value in other applications.</p>",
    "examples": "Example 1: WD-40\nOriginally developed to prevent corrosion in nuclear missiles, WD-40 found hundreds of household uses from loosening stuck zippers to removing crayon marks from walls.\n\nExample 2: Botox\nInitially used to treat eye muscle disorders, Botox was later repurposed for cosmetic applications, creating a multi-billion dollar industry.\n\nExample 3: Shipping Containers as Buildings\nRepurposing shipping containers as architectural elements for homes, offices, retail spaces, and emergency shelters created an entirely new construction approach.",
    "keyTakeaways": "• Look for adjacent uses or scenarios where your product could provide value\n• Consider how byproducts, waste, or underutilized assets could be repurposed\n• Observe how customers are already using your product in unexpected ways\n• New uses often emerge when crossing between industries or demographics\n• Digital assets and intellectual property can often be repurposed across multiple formats",
    "completed": false,
    "order": 6
  },
  {
    "frameworkId": 8,
    "name": "Eliminate",
    "description": "Learn to apply the Eliminate technique to remove unnecessary elements and create simpler solutions.",
    "content": "<h2>The Eliminate Technique</h2><p>Elimination involves removing, reducing, or streamlining elements of a product, service, or process. By questioning what can be taken away rather than added, you can often create more elegant, efficient, and focused solutions.</p><h3>Key Elimination Questions</h3><ul><li>What features, steps, or components could be removed?</li><li>How could this be streamlined or simplified?</li><li>What rules or assumptions could be eliminated?</li><li>What if you stripped this down to its core function?</li><li>What's not essential to the user experience?</li><li>What costs or friction points could be removed?</li></ul><h3>Strategic Approaches to Elimination</h3><p>Elimination can focus on physical components (removing parts), process steps (removing unnecessary actions), or experience elements (removing friction points, decisions, or cognitive load). The goal is often to create a more refined solution that does fewer things exceptionally well.</p>",
    "examples": "Example 1: Minimalist Product Design\nApple eliminated most physical buttons from smartphones with the iPhone, creating a simpler, more intuitive touchscreen interface.\n\nExample 2: Dollar Shave Club\nDollar Shave Club eliminated retail markup and complex product lines, offering a simplified subscription for high-quality razors delivered directly to consumers.\n\nExample 3: No-Code Platforms\nWebsite builders like Wix and Squarespace eliminated the need for coding knowledge, making website creation accessible to non-technical users.",
    "keyTakeaways": "• Elimination often creates value through simplicity, focus, and improved user experience\n• Ask \"What would happen if we removed this?\" about various elements\n• Consider both obvious physical components and invisible aspects like steps, delays, or decisions\n• Elimination can reduce costs while simultaneously improving the user experience\n• Sometimes what you don't include is more important than what you do include",
    "completed": false,
    "order": 7
  },
  {
    "frameworkId": 8,
    "name": "Reverse/Rearrange",
    "description": "Master the Reverse technique to change the order, sequence, or orientation of elements.",
    "content": "<h2>The Reverse/Rearrange Technique</h2><p>This technique involves changing the order, sequence, layout, or orientation of a product, process, or service. By reconsidering how components are arranged or the sequence of steps, you can often discover innovative improvements.</p><h3>Key Reverse/Rearrange Questions</h3><ul><li>What would happen if you reversed the process order?</li><li>How could components be rearranged for better results?</li><li>What if you transposed cause and effect?</li><li>What would an inverted approach look like?</li><li>How could roles be switched or reversed?</li><li>What if you changed the timing or sequence?</li></ul><h3>Types of Reversal and Rearrangement</h3><p>Consider temporal reversals (changing when things happen), spatial reversals (changing where or how things are arranged), role reversals (changing who does what), or logical reversals (changing the underlying assumptions or approaches).</p>",
    "examples": "Example 1: Reverse Auctions\nPriceline reversed the traditional auction model by having sellers compete for buyers rather than buyers competing for products.\n\nExample 2: Just-in-Time Manufacturing\nToyota rearranged manufacturing steps to produce components only when needed rather than building inventory in advance.\n\nExample 3: Dyson Airblade\nDyson reversed the standard hand drying approach from blowing warm air on hands to scraping water off with high-velocity air blades.",
    "keyTakeaways": "• Questioning the established order or sequence can lead to significant breakthroughs\n• Consider multiple dimensions of potential reversal – timing, space, roles, logic\n• Sometimes reversing assumptions about who the customer is or what problem you're solving reveals new opportunities\n• Digital businesses often succeed by reversing traditional industry sequences or information flows\n• Look for processes where cause and effect could be usefully reversed",
    "completed": false,
    "order": 8
  },
  {
    "frameworkId": 8,
    "name": "SCAMPER in Business Strategy",
    "description": "Apply the SCAMPER technique to develop innovative business strategies and competitive advantages.",
    "content": "<h2>Using SCAMPER for Business Strategy</h2><p>SCAMPER isn't just for product innovation; it can be a powerful tool for developing business strategies, improving operations, and creating competitive advantage. By applying these techniques to your business model, value proposition, or customer experience, you can discover breakthrough strategic opportunities.</p><h3>Strategic Applications of SCAMPER</h3><ul><li><strong>Substitute:</strong> Change your target market, distribution channels, or revenue model</li><li><strong>Combine:</strong> Merge services, create partnerships, or integrate vertically/horizontally</li><li><strong>Adapt:</strong> Modify strategies from other industries to fit your context</li><li><strong>Modify:</strong> Scale your offering up or down for different market segments</li><li><strong>Put to another use:</strong> Leverage your core capabilities in new markets</li><li><strong>Eliminate:</strong> Remove unprofitable products or unnecessary steps in your business processes</li><li><strong>Reverse:</strong> Change your relationship with customers, suppliers, or competitors</li></ul>",
    "examples": "Example 1: Netflix's Business Model Evolution\nNetflix used multiple SCAMPER techniques as it evolved: substituting DVDs for VHS, then streaming for DVDs; eliminating late fees; reversing the traditional release model with original content; and modifying pricing strategies for different markets.\n\nExample 2: Amazon Web Services\nAmazon put its internal infrastructure to another use by offering cloud computing services to external customers, creating a massive new revenue stream from existing capabilities.\n\nExample 3: Ikea\nIkea reversed traditional furniture retailing by having customers assemble products themselves, eliminating assembly costs, combining showroom and warehouse, and modifying the shopping experience to guide customers through their entire space.",
    "keyTakeaways": "• Apply SCAMPER to all aspects of your business, not just products or services\n• Use the technique to question fundamental industry assumptions\n• The most powerful strategic innovations often combine multiple SCAMPER elements\n• Use SCAMPER to evaluate competitors and identify potential disruption threats\n• Regularly review your business model using SCAMPER to avoid complacency",
    "completed": false,
    "order": 9
  }
]